soap/REQUEST/country/get-country.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <auth:Authorization xmlns:auth="http://duckacademy.nl/springsoap/">ValidAuthToken</auth:Authorization>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns2:getCountryRequest xmlns:ns2="http://duckacademy.nl/springsoap/gen">
            <ns2:name>Spain</ns2:name>
        </ns2:getCountryRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>